<a href="https://colab.research.google.com/github/DSF-Kotaro/classroom/blob/main/%E3%80%90%E7%AC%AC14%E5%9B%9E%E3%80%91%E6%98%A5%E5%AD%A6%E6%9C%9F%E7%B7%8F%E5%90%88%E6%BC%94%E7%BF%92%EF%BC%91.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##問題１　<br>「numpy」「numpy.randm」「scipy」「pandas」「Series」「DataFrame」「matplotlib.pyplot」「matplotlib」「seaborn」を読み込みなさい。<br>Problem 1 <br>Load "numpy" "numpy.randm" "scipy" "pandas" "Series" "DataFrame" "matplotlib.pyplot" "matplotlib" "seaborn"

In [8]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns

##問題２<br>customer_master.csvを読み込み、データフレーム名を「customer_master」としてください。<br>Problem 2 <br>Please load customer_master.csv and set the data frame name to "customer_master".

In [9]:
customer_master = pd.read_csv('customer_master.csv',sep=',')
customer_master

     customer_id customer_name    registration_date  ... age       birth pref
0       IK152942        平田 裕次郎  2019-01-01 00:25:33  ...  29   1990/6/10  石川県
1       TS808488         田村 詩織  2019-01-01 01:13:45  ...  33   1986/5/20  東京都
2       AS834628         久野 由樹  2019-01-01 02:00:14  ...  63    1956/1/2  茨城県
3       AS345469          鶴岡 薫  2019-01-01 04:48:22  ...  74   1945/3/25  東京都
4       GD892565         大内 高史  2019-01-01 04:54:51  ...  54    1965/8/5  千葉県
...          ...           ...                  ...  ...  ..         ...  ...
4995    AS677229         平山 莉沙  2019-07-31 16:52:26  ...  77  1941/10/17  愛知県
4996    HD758694        中原 まひる  2019-07-31 19:09:26  ...  27  1991/11/13  茨城県
4997    PL538517         田端 由宇  2019-07-31 19:30:05  ...  73  1945/12/28  愛知県
4998    OA955088         瀬戸内 光  2019-07-31 22:32:08  ...  75    1944/4/9  宮城県
4999    HI349563         堀井 寛治  2019-07-31 22:49:49  ...  21    1998/2/6  広島県

[5000 rows x 9 columns]

##問題３　<br>「item_master.csv」「transaction_1.csv」「transaction_2.csv」「transaction_detail_1.csv」「transaction_detail_2.csv」についても読み込みなさい。また、その時のデータフレーム名はそれぞれ「item_master」「transaction_1」「transaction_2」「transaction_detail_1」「transaction_detail_2」としなさい。<br>Problem３<br>Please load "item_master.csv" "transaction_1.csv" "transaction_2.csv" "transaction_detail_1.csv" "transaction_detail_2.csv".Also, the data frame names at that time should be "item_master", "transaction_1", "transaction_2", "transaction_detail_1", and "transaction_detail_2", respectively.

In [10]:
item_master = pd.read_csv('item_master.csv',sep=',')
transaction_1 = pd.read_csv('transaction_1.csv',sep=',')
transaction_2 = pd.read_csv('transaction_2.csv',sep=',')
transaction_detail_1 = pd.read_csv('transaction_detail_1.csv',sep=',')
transaction_detail_2 = pd.read_csv('transaction_detail_2.csv',sep=',')

##問題４<br>「transaction_1」と「transaction_2」を結合し,「transaction」という名前にしてください。<br>Problem４<br>Combine "transaction_1" and "transaction_2" and name it "transaction".

In [11]:
transaction = pd.concat([transaction_1, transaction_2])
transaction

     transaction_id   price         payment_date customer_id
0       T0000000113  210000  2019-02-01 01:36:57    PL563502
1       T0000000114   50000  2019-02-01 01:37:23    HD678019
2       T0000000115  120000  2019-02-01 02:34:19    HD298120
3       T0000000116  210000  2019-02-01 02:47:23    IK452215
4       T0000000117  170000  2019-02-01 04:33:46    PL542865
...             ...     ...                  ...         ...
1781    T0000006894  180000  2019-07-31 21:20:44    HI400734
1782    T0000006895   85000  2019-07-31 21:52:48    AS339451
1783    T0000006896  100000  2019-07-31 23:35:25    OA027325
1784    T0000006897   85000  2019-07-31 23:39:35    TS624738
1785    T0000006898   85000  2019-07-31 23:41:38    AS834214

[6786 rows x 4 columns]

##問題５<br>「transaction_detail_1」と「transaction_detail_2」を結合し,「transaction_detail」という名前にしてください。<br>Problem５<br>Combine "transaction_1" and "transaction_2" and name it "transaction".

In [12]:
transaction_detail = pd.concat([transaction_detail_1, transaction_detail_2])
transaction_detail

      detail_id transaction_id item_id  quantity
0             0    T0000000113    S005         1
1             1    T0000000114    S001         1
2             2    T0000000115    S003         1
3             3    T0000000116    S005         1
4             4    T0000000117    S002         2
...         ...            ...     ...       ...
2139       7139    T0000006894    S004         1
2140       7140    T0000006895    S002         1
2141       7141    T0000006896    S001         2
2142       7142    T0000006897    S002         1
2143       7143    T0000006898    S002         1

[7144 rows x 4 columns]

##問題６<br>以下のプログラムを実行しなさい。<br>Problem 6<br> Execute the following program.

In [20]:
join_data = pd.merge(transaction_detail, transaction[["transaction_id","payment_date","customer_id"]],on = "transaction_id", how = "left")
join_data = pd.merge(join_data, customer_master, on = "customer_id", how = "left")
join_data = pd.merge(join_data,item_master, on ="item_id", how = "left")
join_data.head()

   detail_id transaction_id item_id  ...  pref item_name item_price
0          0    T0000000113    S005  ...   熊本県      PC-E     210000
1          1    T0000000114    S001  ...   京都府      PC-A      50000
2          2    T0000000115    S003  ...   茨城県      PC-C     120000
3          3    T0000000116    S005  ...   兵庫県      PC-E     210000
4          4    T0000000117    S002  ...   長崎県      PC-B      85000

[5 rows x 16 columns]

##問題７<br>「transaction_detail」「transaction」「join_data」のデータ件数を確認しなさい。<br>Problem 7<br> Check the number of data in "transaction_detail", "transaction", and "join_data".

In [21]:
print(len(transaction_detail))
print(len(transaction))
print(len(join_data))

7144
6786
7144

##問題８<br>以下のプログラムを実行しなさい。<br>Problem 8<br> Execute the following program.

In [22]:
join_data["price"] = join_data["quantity"] * join_data["item_price"]
join_data[["quantity","item_price","price"]]

      quantity  item_price   price
0            1      210000  210000
1            1       50000   50000
2            1      120000  120000
3            1      210000  210000
4            2       85000  170000
...        ...         ...     ...
7139         1      180000  180000
7140         1       85000   85000
7141         2       50000  100000
7142         1       85000   85000
7143         1       85000   85000

[7144 rows x 3 columns]

##問題９　<br>「join_data」の"price"について、合計値を求めなさい。また、「transaction」の”price”についても、合計値を求めなさい。<br>Problem 9<br> Find the total value for "price" of "join_data". Also, find the total value for "price" of "transaction".

In [23]:
print(join_data["price"].sum())
print(transaction["price"].sum())

971135000
971135000

問題１０<br>「join_data」について、"describe"メソッドを使って、統計量を表示させなさい。<br>Problem 10<br> For "join_data", use the "describe" method to display the statistic.

In [24]:
join_data.describe()

         detail_id     quantity          age     item_price          price
count  7144.000000  7144.000000  7144.000000    7144.000000    7144.000000
mean   3571.500000     1.199888    50.265677  121698.628219  135937.150056
std    2062.439494     0.513647    17.190314   64571.311830   68511.453297
min       0.000000     1.000000    20.000000   50000.000000   50000.000000
25%    1785.750000     1.000000    36.000000   50000.000000   85000.000000
50%    3571.500000     1.000000    50.000000  102500.000000  120000.000000
75%    5357.250000     1.000000    65.000000  187500.000000  210000.000000
max    7143.000000     4.000000    80.000000  210000.000000  420000.000000